9/data/attachments/8b0ed06921b65825.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsPageRequest>
            <nif:username>soap_friends_033d585e-c0e3-460d-a752-926cb5fb8ca7</nif:username>
            <nif:pageInfo>
                <nif:page>2</nif:page>
                <nif:size>3</nif:size>
                
            </nif:pageInfo>
            
        </nif:friendsPageRequest>
    </soapenv:Body>
</soapenv:Envelope>